## :x: Apply結果

[GitHub Actions上の実行詳細へのリンク](https://github.com/melanmeg/my-cloudnative-entry/actions/runs/12293687112)



**Error: Error creating service account: googleapi: Error 403: Permission &#39;iam.serviceAccounts.create&#39; denied on resource (or it may not exist).
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;iam.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;permission&#34;: &#34;iam.serviceAccounts.create&#34;
    },
    &#34;reason&#34;: &#34;IAM_PERMISSION_DENIED&#34;
  }
]
, forbidden

  with google_service_account.bigquery_sa,
  on main.tf line 8, in resource &#34;google_service_account&#34; &#34;bigquery_sa&#34;:
   8: resource &#34;google_service_account&#34; &#34;bigquery_sa&#34; {

::error::Terraform exited with code 1.**

<details><summary>詳細はこちら</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_binding.bigquery_sa_binding will be created
  + resource "google_project_iam_binding" "bigquery_sa_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "my-project-melanmeg"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_service_account.bigquery_sa will be created
  + resource "google_service_account" "bigquery_sa" {
      + account_id   = "github-actions-sa"
      + disabled     = false
      + display_name = "BigQuery Access Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "my-project-melanmeg"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.bigquery_sa_permission will be created
  + resource "google_service_account_iam_member" "bigquery_sa_permission" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:cost-monitoring-sa@test-project-373118.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
google_service_account.bigquery_sa: Creating...

Error: Error creating service account: googleapi: Error 403: Permission 'iam.serviceAccounts.create' denied on resource (or it may not exist).
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "iam.googleapis.com",
    "metadata": {
      "permission": "iam.serviceAccounts.create"
    },
    "reason": "IAM_PERMISSION_DENIED"
  }
]
, forbidden

  with google_service_account.bigquery_sa,
  on main.tf line 8, in resource "google_service_account" "bigquery_sa":
   8: resource "google_service_account" "bigquery_sa" {

::error::Terraform exited with code 1.

```

</details>



<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":13,"Program":"tfcmt","SHA1":"93bf1ecfb25fbf242b194a7d09923e906d31847d","Vars":{},"WorkflowName":"terraform-apply"} -->